src/wsdl/ose.efact.pe/ol-ti-itcpe/billService.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10 svn-revision#919b322c92f13ad085a933e8dd6dd35d4947364b. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.2.10 svn-revision#919b322c92f13ad085a933e8dd6dd35d4947364b. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://service.gem.factura.comppago.registro.servicio.sunat.gob.pe/" name="BillServiceImplService">
<import namespace="http://service.sunat.gob.pe" location="http://ose.efact.pe:80/ol-ti-itcpe/billService?wsdl=1"/>
<wsp:Policy wsu:Id="BillServiceImplPortBinding_MTOM_Policy">
<ns1:OptimizedMimeSerialization xmlns:ns1="http://schemas.xmlsoap.org/ws/2004/09/policy/optimizedmimeserialization" wsp:Optional="true"/>
</wsp:Policy>
<binding xmlns:ns2="http://service.sunat.gob.pe" name="BillServiceImplPortBinding" type="ns2:BillService">
<wsp:PolicyReference URI="#BillServiceImplPortBinding_MTOM_Policy"/>
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
<operation name="sendSummary">
<soap:operation soapAction="urn:sendSummary"/>
<input>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</input>
<output>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</output>
</operation>
<operation name="sendPack">
<soap:operation soapAction="urn:sendPack"/>
<input>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</input>
<output>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</output>
</operation>
<operation name="getStatusCdr">
<soap:operation soapAction="urn:getStatusCdr"/>
<input>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</input>
<output>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</output>
</operation>
<operation name="sendBill">
<soap:operation soapAction="urn:sendBill"/>
<input>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</input>
<output>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</output>
</operation>
<operation name="getStatus">
<soap:operation soapAction="urn:getStatus"/>
<input>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</input>
<output>
<soap:body use="literal" namespace="http://service.sunat.gob.pe"/>
</output>
</operation>
</binding>
<service name="BillServiceImplService">
<port name="BillServiceImplPort" binding="tns:BillServiceImplPortBinding">
<soap:address location="http://ose.efact.pe:80/ol-ti-itcpe/billService"/>
</port>
</service>
</definitions>